app/views/static_content/show.html.erb

<% content_for :sidebar do %>
        <% if Page.sidebar_links.any? %>
---
SELECT COUNT(*) FROM `pages` WHERE (show_in_sidebar = 1)
SELECT `pages`.* FROM `pages` WHERE (show_in_header = 1) ORDER BY position ASC